callwilliam66/ATF_NXP_Z_MD/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1064xxxxA
package_id: MIMXRT1064DVL6A
mcu_data: ksdk2_0
processor_version: 9.0.1
pin_labels:
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: UART2_TX, identifier: DI_10;UART2_TX}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: UART2_SEL, identifier: MCU_TP4;UART2_SEL}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: MCU_TP6, identifier: MCU_TP6}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: DI_6, identifier: DI_6}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: UART2_RX, identifier: MCU_TP3;UART2_RX}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: MCU_TP5, identifier: MCU_TP5}
- {pin_num: C1, pin_signal: GPIO_EMC_21, label: LED_G5, identifier: LED_G5}
- {pin_num: C2, pin_signal: GPIO_EMC_09, label: LED_G1, identifier: LED_G1}
- {pin_num: C3, pin_signal: GPIO_EMC_36, label: MCU_SW7, identifier: MCU_SW7}
- {pin_num: C4, pin_signal: GPIO_EMC_33, label: MCU_SW4, identifier: MCU_SW4}
- {pin_num: A4, pin_signal: GPIO_EMC_17, label: MCU_SW5, identifier: MCU_SW5}
- {pin_num: B2, pin_signal: GPIO_EMC_18, label: MCU_SW1, identifier: MCU_SW1}
- {pin_num: D2, pin_signal: GPIO_EMC_25, label: LED_G4, identifier: LED_G4}
- {pin_num: D3, pin_signal: GPIO_EMC_24, label: MCU_SW6, identifier: MCU_SW6}
- {pin_num: D4, pin_signal: GPIO_EMC_34, label: DO_0, identifier: LED_G3;DO_0}
- {pin_num: D5, pin_signal: GPIO_EMC_32, label: MCU_SW3, identifier: MCU_SW3}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: PWM_UH, identifier: PWM_UH}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: PWM_UL, identifier: PWM_UL}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: PWM_VH, identifier: PWM_VH}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: PWM_VL, identifier: PWM_VL}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: PWM_WH, identifier: PWM_WH}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: PWM_WL, identifier: PWM_WL}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: CUR_U, identifier: CUR_U}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: CUR_V, identifier: CUR_V}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: CUR_W, identifier: CUR_W}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: CUR_BUS, identifier: CUR_BUS;CUR_BUS_OC_CMP}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: DI_9, identifier: DI_9}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: Light_V_Out, identifier: DOUT9;Light_V_Out}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: VOLT_BUS, identifier: VOLT_BUS;VOLT_BUS_OV_CMP;}
- {pin_num: L3, pin_signal: GPIO_SD_B1_06, label: MCU_TP13, identifier: MCU_TP13}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: SPI_HMI_SCS, identifier: SPI_HMI_SCS}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: SPI_HMI_SCK, identifier: SPI_HMI_SCK}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: SPI_HMI_SDI, identifier: SPI_HMI_SDI}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: SPI_HMI_SDO, identifier: SPI_HMI_SDO}
- {pin_num: C6, pin_signal: GPIO_EMC_30, label: MCU_SW2, identifier: MCU_SW2}
- {pin_num: A7, pin_signal: GPIO_EMC_40, label: DIN_1, identifier: MCU_SW8;DIN_1}
- {pin_num: C7, pin_signal: GPIO_EMC_41, label: DIN_2, identifier: MCU_TP1;DIN_2}
- {pin_num: G1, pin_signal: GPIO_EMC_10, label: LED_G2, identifier: LED_G2}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: MCU_BOOT0, identifier: MCU_BOOT0}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: MCU_BOOT1, identifier: MCU_BOOT1}
- {pin_num: F1, pin_signal: GPIO_EMC_22, label: ENC_EN, identifier: ENC_EN}
- {pin_num: F3, pin_signal: GPIO_EMC_01, label: ENC_ANGLE_A_POS_A, identifier: ENC_ANGLE_A;ENC_POS_A}
- {pin_num: E3, pin_signal: GPIO_EMC_00, label: ENC_ANGLE_B_POS_B, identifier: ENC_ANGLE_B;ENC_POS_B}
- {pin_num: F2, pin_signal: GPIO_EMC_04, label: ENC_ANGLE_Z, identifier: ENC_ANGLE_Z}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: USB_UART_TX, identifier: USB_UART_TX}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: USB_UART_RX, identifier: USB_UART_RX}
- {pin_num: K12, pin_signal: GPIO_AD_B1_05, label: USB_UART_DET, identifier: USB_UART_DET}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: USB_UART_RST, identifier: USB_UART_RST}
- {pin_num: G2, pin_signal: GPIO_EMC_23, label: LED_G6, identifier: LED_G6}
- {pin_num: G3, pin_signal: GPIO_EMC_11, label: ENC_U, identifier: ENC_U}
- {pin_num: G4, pin_signal: GPIO_EMC_03, label: ENC_V, identifier: ENC_V}
- {pin_num: G5, pin_signal: GPIO_EMC_05, label: ENC_W, identifier: ENC_W}
- {pin_num: H5, pin_signal: GPIO_EMC_06, label: LED_B1, identifier: LED_B1}
- {pin_num: H4, pin_signal: GPIO_EMC_07, label: LED_B2, identifier: LED_B2}
- {pin_num: H3, pin_signal: GPIO_EMC_08, label: LED_B3, identifier: LED_B3}
- {pin_num: E5, pin_signal: GPIO_EMC_35, label: LED_G7, identifier: LED_G7}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: SYS_TEMP, identifier: MCU_TP2;TEMP;SYS_TEMP}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: MCU_TP7, identifier: MCU_TP7}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: MCU_TP8, identifier: MCU_TP8}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: MCU_TP9, identifier: MCU_TP9}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: MCU_TP10, identifier: MCU_TP10}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: MCU_TP11, identifier: MCU_TP11}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: MCU_TP12, identifier: MCU_TP12}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: HSIO1, identifier: DI_0;HSIO1}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: HSIO2, identifier: DI_1;HSIO2}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: HSIO4, identifier: DI_2;HSIO4}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: HSIO5, identifier: DI_3;HSIO5}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: LD_ENABLE, identifier: DI_4;LD_ENABLE}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: DI_5, identifier: DI_5}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: DI_7, identifier: DI_7}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: HSIO3, identifier: DOUT0;HSIO3}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: ENC_EN, identifier: DOUT1;ENC_EN}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: Light_PWM, identifier: DOUT2;Light_PWM}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: DOUT3, identifier: DOUT3}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: DOUT4, identifier: DOUT4}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: DOUT5, identifier: DOUT5}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: LD_STB, identifier: DOUT6;LD_STB}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: DOUT7, identifier: DOUT7}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: DOUT8, identifier: DOUT8}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: DOUT10, identifier: DOUT10}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: TEMP, identifier: TEMP}
- {pin_num: A2, pin_signal: GPIO_EMC_27, label: LED_RED, identifier: SPI_COMM_SCK;LED_RED}
- {pin_num: D1, pin_signal: GPIO_EMC_28, label: SPI_COMM_SDO, identifier: SPI_COMM_SDO}
- {pin_num: E1, pin_signal: GPIO_EMC_29, label: SPI_COMM_SDI, identifier: SPI_COMM_SDI}
- {pin_num: C5, pin_signal: GPIO_EMC_31, label: DI_A, identifier: SPI_COMM_SCS;DI_A}
- {pin_num: F4, pin_signal: GPIO_EMC_02, label: PULSE, identifier: PULSE_PLS_CW;PULSE_CCW}
- {pin_num: E4, pin_signal: GPIO_EMC_37, label: PULSE, identifier: PULSE_DIR}
- {pin_num: A6, pin_signal: GPIO_EMC_13, label: RS422_UART_TX, identifier: RS422_UART_TX}
- {pin_num: B6, pin_signal: GPIO_EMC_14, label: RS422_UART_RX, identifier: RS422_UART_RX}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: DI_8, identifier: DI_8}
- {pin_num: B4, pin_signal: GPIO_EMC_19, label: UART4_TX, identifier: UART4_TX}
- {pin_num: A3, pin_signal: GPIO_EMC_20, label: UART4_RX, identifier: UART4_RX}
- {pin_num: B7, pin_signal: GPIO_EMC_39, label: DIN_0, identifier: DIN_0}
- {pin_num: B3, pin_signal: GPIO_EMC_26, label: LED_G, identifier: LED_G}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

