callwilliam66/ATF_NXP_Z_MD/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D4, peripheral: GPIO3, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_34, identifier: DO_0, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: J4, peripheral: PWM1, signal: 'A, 0', pin_signal: GPIO_SD_B0_00, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: J3, peripheral: PWM1, signal: 'B, 0', pin_signal: GPIO_SD_B0_01, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: J1, peripheral: PWM1, signal: 'A, 1', pin_signal: GPIO_SD_B0_02, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: K1, peripheral: PWM1, signal: 'B, 1', pin_signal: GPIO_SD_B0_03, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: H2, peripheral: PWM1, signal: 'A, 2', pin_signal: GPIO_SD_B0_04, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: J2, peripheral: PWM1, signal: 'B, 2', pin_signal: GPIO_SD_B0_05, direction: OUTPUT, pull_up_down_config: Pull_Down_100K_Ohm}
  - {peripheral: PWM1, signal: 'FAULT, 1', pin_signal: LOGIC_LOW}
  - {peripheral: PWM1, signal: 'FAULT, 2', pin_signal: LOGIC_LOW}
  - {peripheral: PWM1, signal: 'FAULT, 3', pin_signal: LOGIC_LOW}
  - {pin_num: H13, peripheral: ADC1, signal: 'IN, 13', pin_signal: GPIO_AD_B1_08}
  - {pin_num: H14, peripheral: ADC1, signal: 'IN, 3', pin_signal: GPIO_AD_B0_14}
  - {pin_num: J14, peripheral: ADC2, signal: 'IN, 4', pin_signal: GPIO_AD_B1_15}
  - {pin_num: J12, peripheral: ADC1, signal: 'IN, 11', pin_signal: GPIO_AD_B1_06, identifier: VOLT_BUS}
  - {pin_num: J13, peripheral: CMP1, signal: 'IN, 6', pin_signal: GPIO_AD_B1_11, identifier: CUR_BUS_OC_CMP}
  - {peripheral: ADC_ETC, signal: 'XBAR0_TRIG, 0', pin_signal: FLEXPWM1_PWM1_OUT_TRIG0_1}
  - {peripheral: ADC_ETC, signal: 'XBAR1_TRIG, 0', pin_signal: FLEXPWM1_PWM1_OUT_TRIG0_1}
  - {pin_num: A7, peripheral: GPIO3, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_40, identifier: DIN_1, direction: INPUT}
  - {pin_num: C7, peripheral: GPIO3, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_41, identifier: DIN_2, direction: INPUT}
  - {pin_num: F11, peripheral: GPIO1, signal: 'gpio_io, 04', pin_signal: GPIO_AD_B0_04, direction: INPUT}
  - {pin_num: G14, peripheral: GPIO1, signal: 'gpio_io, 05', pin_signal: GPIO_AD_B0_05, direction: INPUT}
  - {pin_num: E3, peripheral: ENC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_00, identifier: ENC_ANGLE_B}
  - {pin_num: F3, peripheral: ENC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_01, identifier: ENC_ANGLE_A}
  - {peripheral: ENC1, signal: TRG, pin_signal: FLEXPWM1_PWM1_OUT_TRIG0_1}
  - {pin_num: E3, peripheral: ENC2, signal: 'PHASE, A', pin_signal: GPIO_EMC_00, identifier: ENC_POS_B}
  - {pin_num: F3, peripheral: ENC2, signal: 'PHASE, B', pin_signal: GPIO_EMC_01, identifier: ENC_POS_A}
  - {peripheral: ENC2, signal: TRG, pin_signal: FLEXPWM1_PWM1_OUT_TRIG0_1}
  - {pin_num: B14, peripheral: GPIO2, signal: 'gpio_io, 31', pin_signal: GPIO_B1_15, identifier: LD_ENABLE, direction: OUTPUT, pull_up_down_config: Pull_Up_22K_Ohm}
  - {pin_num: K14, peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_12}
  - {pin_num: L14, peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_13}
  - {peripheral: PWM1, signal: 'FAULT, 0', pin_signal: ACMP1_OUT}
  - {pin_num: G4, peripheral: GPIO4, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_03, direction: INPUT}
  - {pin_num: K10, peripheral: ADC1, signal: 'IN, 12', pin_signal: GPIO_AD_B1_07, identifier: SYS_TEMP, direction: INPUT}
  - {pin_num: C13, peripheral: GPIO2, signal: 'gpio_io, 27', pin_signal: GPIO_B1_11, identifier: ENC_EN, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: D14, peripheral: GPIO2, signal: 'gpio_io, 29', pin_signal: GPIO_B1_13, identifier: LD_STB, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: A2, peripheral: GPIO4, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_27, identifier: LED_RED, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: B6, peripheral: LPUART3, signal: RX, pin_signal: GPIO_EMC_14}
  - {pin_num: A6, peripheral: LPUART3, signal: TX, pin_signal: GPIO_EMC_13}
  - {pin_num: F2, peripheral: ENC1, signal: INDEX, pin_signal: GPIO_EMC_04}
  - {pin_num: B4, peripheral: LPUART4, signal: TX, pin_signal: GPIO_EMC_19}
  - {pin_num: A3, peripheral: LPUART4, signal: RX, pin_signal: GPIO_EMC_20}
  - {pin_num: B7, peripheral: GPIO3, signal: 'gpio_io, 25', pin_signal: GPIO_EMC_39, direction: INPUT}
  - {pin_num: B3, peripheral: GPIO4, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_26, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: C14, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_B1_14, identifier: Light_PWM, direction: OUTPUT}
  - {pin_num: H11, peripheral: ADC2, signal: 'IN, 2', pin_signal: GPIO_AD_B1_13, identifier: Light_V_Out}
  - {pin_num: C5, peripheral: GPIO4, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_31, identifier: DI_A, direction: INPUT}
  - {pin_num: C12, peripheral: GPIO2, signal: 'gpio_io, 22', pin_signal: GPIO_B1_06, identifier: HSIO3, direction: OUTPUT}
  - {pin_num: B12, peripheral: GPIO2, signal: 'gpio_io, 23', pin_signal: GPIO_B1_07, identifier: HSIO1, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: A12, peripheral: GPIO2, signal: 'gpio_io, 24', pin_signal: GPIO_B1_08, identifier: HSIO2, direction: OUTPUT}
  - {pin_num: A13, peripheral: GPIO2, signal: 'gpio_io, 25', pin_signal: GPIO_B1_09, identifier: HSIO4, direction: INPUT}
  - {pin_num: B13, peripheral: GPIO2, signal: 'gpio_io, 26', pin_signal: GPIO_B1_10, identifier: HSIO5, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Disable,
    hysteresis_enable: Disable, pull_up_down_config: Pull_Up_47K_Ohm, pull_keeper_select: Keeper}
  - {pin_num: E14, peripheral: JTAG, signal: TMS, pin_signal: GPIO_AD_B0_06}
  - {pin_num: F12, peripheral: JTAG, signal: TCK, pin_signal: GPIO_AD_B0_07}
  - {pin_num: F13, peripheral: JTAG, signal: MOD, pin_signal: GPIO_AD_B0_08}
  - {pin_num: F14, peripheral: JTAG, signal: TDI, pin_signal: GPIO_AD_B0_09}
  - {pin_num: G13, peripheral: JTAG, signal: TDO, pin_signal: GPIO_AD_B0_10}
  - {pin_num: G10, peripheral: JTAG, signal: TRSTB, pin_signal: GPIO_AD_B0_11}
  - {pin_num: L12, peripheral: GPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AD_B1_04, identifier: UART2_SEL, direction: OUTPUT}
  - {pin_num: L11, peripheral: LPUART2, signal: TX, pin_signal: GPIO_AD_B1_02, identifier: UART2_TX}
  - {pin_num: M12, peripheral: LPUART2, signal: RX, pin_signal: GPIO_AD_B1_03, identifier: UART2_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

