callwilliam66/ATF_NXP_Z_MD/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           
  CLOCK_EnableClock(kCLOCK_Xbar1);            

  /* GPIO configuration of MCU_BOOT0 on GPIO_AD_B0_04 (pin F11) */
  gpio_pin_config_t MCU_BOOT0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_04 (pin F11) */
  GPIO_PinInit(GPIO1, 4U, &MCU_BOOT0_config);

  /* GPIO configuration of MCU_BOOT1 on GPIO_AD_B0_05 (pin G14) */
  gpio_pin_config_t MCU_BOOT1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_05 (pin G14) */
  GPIO_PinInit(GPIO1, 5U, &MCU_BOOT1_config);

  /* GPIO configuration of UART2_SEL on GPIO_AD_B1_04 (pin L12) */
  gpio_pin_config_t UART2_SEL_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin L12) */
  GPIO_PinInit(GPIO1, 20U, &UART2_SEL_config);

  /* GPIO configuration of HSIO3 on GPIO_B1_06 (pin C12) */
  gpio_pin_config_t HSIO3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_06 (pin C12) */
  GPIO_PinInit(GPIO2, 22U, &HSIO3_config);

  /* GPIO configuration of HSIO1 on GPIO_B1_07 (pin B12) */
  gpio_pin_config_t HSIO1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_07 (pin B12) */
  GPIO_PinInit(GPIO2, 23U, &HSIO1_config);

  /* GPIO configuration of HSIO2 on GPIO_B1_08 (pin A12) */
  gpio_pin_config_t HSIO2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_08 (pin A12) */
  GPIO_PinInit(GPIO2, 24U, &HSIO2_config);

  /* GPIO configuration of HSIO4 on GPIO_B1_09 (pin A13) */
  gpio_pin_config_t HSIO4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_09 (pin A13) */
  GPIO_PinInit(GPIO2, 25U, &HSIO4_config);

  /* GPIO configuration of HSIO5 on GPIO_B1_10 (pin B13) */
  gpio_pin_config_t HSIO5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_10 (pin B13) */
  GPIO_PinInit(GPIO2, 26U, &HSIO5_config);

  /* GPIO configuration of ENC_EN on GPIO_B1_11 (pin C13) */
  gpio_pin_config_t ENC_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_11 (pin C13) */
  GPIO_PinInit(GPIO2, 27U, &ENC_EN_config);

  /* GPIO configuration of LD_STB on GPIO_B1_13 (pin D14) */
  gpio_pin_config_t LD_STB_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_13 (pin D14) */
  GPIO_PinInit(GPIO2, 29U, &LD_STB_config);

  /* GPIO configuration of LD_ENABLE on GPIO_B1_15 (pin B14) */
  gpio_pin_config_t LD_ENABLE_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_15 (pin B14) */
  GPIO_PinInit(GPIO2, 31U, &LD_ENABLE_config);

  /* GPIO configuration of DO_0 on GPIO_EMC_34 (pin D4) */
  gpio_pin_config_t DO_0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_34 (pin D4) */
  GPIO_PinInit(GPIO3, 20U, &DO_0_config);

  /* GPIO configuration of DIN_0 on GPIO_EMC_39 (pin B7) */
  gpio_pin_config_t DIN_0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_39 (pin B7) */
  GPIO_PinInit(GPIO3, 25U, &DIN_0_config);

  /* GPIO configuration of DIN_1 on GPIO_EMC_40 (pin A7) */
  gpio_pin_config_t DIN_1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_40 (pin A7) */
  GPIO_PinInit(GPIO3, 26U, &DIN_1_config);

  /* GPIO configuration of DIN_2 on GPIO_EMC_41 (pin C7) */
  gpio_pin_config_t DIN_2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_41 (pin C7) */
  GPIO_PinInit(GPIO3, 27U, &DIN_2_config);

  /* GPIO configuration of ENC_V on GPIO_EMC_03 (pin G4) */
  gpio_pin_config_t ENC_V_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_03 (pin G4) */
  GPIO_PinInit(GPIO4, 3U, &ENC_V_config);

  /* GPIO configuration of LED_G on GPIO_EMC_26 (pin B3) */
  gpio_pin_config_t LED_G_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_26 (pin B3) */
  GPIO_PinInit(GPIO4, 26U, &LED_G_config);

  /* GPIO configuration of LED_RED on GPIO_EMC_27 (pin A2) */
  gpio_pin_config_t LED_RED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_27 (pin A2) */
  GPIO_PinInit(GPIO4, 27U, &LED_RED_config);

  /* GPIO configuration of DI_A on GPIO_EMC_31 (pin C5) */
  gpio_pin_config_t DI_A_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_31 (pin C5) */
  GPIO_PinInit(GPIO4, 31U, &DI_A_config);

